#ifndef __EXCEPTIONS_H__
#define __EXCEPTIONS_H__

#include "types.h"

struct exception_vector {
/* 000 */   ptr_t       initial_sp;
/* 001 */   ptr_t       initial_pc;
/* 002 */   ptr_t       bus_err;
/* 003 */   ptr_t       addr_err;
/* 004 */   ptr_t       illegal_instruction;
/* 005 */   ptr_t       divzero;
/* 006 */   ptr_t       chk_instruction;
/* 007 */   ptr_t       trap_instruction;
/* 008 */   ptr_t       privilege_violation;
/* 009 */   ptr_t       trace;
/* 010 */   ptr_t       line_1010_emu;
/* 011 */   ptr_t       line_1111_emu;
/* 012 */   ptr_t       __reserved12;
/* 013 */   ptr_t       coproc_protocol_volation;
/* 014 */   ptr_t       format_error;
/* 015 */   ptr_t       uninitialized_interrupt;
/* 016 */   ptr_t       __reserved16;
/* 017 */   ptr_t       __reserved17;
/* 018 */   ptr_t       __reserved18;
/* 019 */   ptr_t       __reserved19;
/* 020 */   ptr_t       __reserved20;
/* 021 */   ptr_t       __reserved21;
/* 022 */   ptr_t       __reserved22;
/* 023 */   ptr_t       __reserved23;
/* 024 */   ptr_t       spurious_interrupt;
/* 025 */   ptr_t       ipl_level1;
/* 026 */   ptr_t       ipl_level2;
/* 027 */   ptr_t       ipl_level3;
/* 028 */   ptr_t       ipl_level4;
/* 029 */   ptr_t       ipl_level5;
/* 030 */   ptr_t       ipl_level6;
/* 031 */   ptr_t       ipl_level7;
/* 032 */   ptr_t       trap_0;
/* 033 */   ptr_t       trap_1;
/* 034 */   ptr_t       trap_2;
/* 035 */   ptr_t       trap_3;
/* 036 */   ptr_t       trap_4;
/* 037 */   ptr_t       trap_5;
/* 038 */   ptr_t       trap_6;
/* 039 */   ptr_t       trap_7;
/* 040 */   ptr_t       trap_8;
/* 041 */   ptr_t       trap_9;
/* 042 */   ptr_t       trap_10;
/* 043 */   ptr_t       trap_11;
/* 044 */   ptr_t       trap_12;
/* 045 */   ptr_t       trap_13;
/* 046 */   ptr_t       trap_14;
/* 047 */   ptr_t       trap_15;
/* 048 */   ptr_t       fpcp_unordered_cond;
/* 049 */   ptr_t       fpcp_inexact;
/* 050 */   ptr_t       fpcp_divzero;
/* 051 */   ptr_t       fpcp_underflow;
/* 052 */   ptr_t       fpcp_operand_err;
/* 053 */   ptr_t       fpcp_overflow;
/* 054 */   ptr_t       fpcp_nan;
/* 055 */   ptr_t       __reserved55;
/* 056 */   ptr_t       mmu_config_err;
/* 057 */   ptr_t       __reserved57;
/* 058 */   ptr_t       __reserved58;
/* 059 */   ptr_t       __reserved59;
/* 060 */   ptr_t       __reserved60;
/* 061 */   ptr_t       __reserved61;
/* 062 */   ptr_t       __reserved62;
/* 063 */   ptr_t       __reserved63;
/* 064 */   ptr_t       userdef_064;
/* 065 */   ptr_t       userdef_065;
/* 066 */   ptr_t       userdef_066;
/* 067 */   ptr_t       userdef_067;
/* 068 */   ptr_t       userdef_068;
/* 069 */   ptr_t       userdef_069;
/* 070 */   ptr_t       userdef_070;
/* 071 */   ptr_t       userdef_071;
/* 072 */   ptr_t       userdef_072;
/* 073 */   ptr_t       userdef_073;
/* 074 */   ptr_t       userdef_074;
/* 075 */   ptr_t       userdef_075;
/* 076 */   ptr_t       userdef_076;
/* 077 */   ptr_t       userdef_077;
/* 078 */   ptr_t       userdef_078;
/* 079 */   ptr_t       userdef_079;
/* 080 */   ptr_t       userdef_080;
/* 081 */   ptr_t       userdef_081;
/* 082 */   ptr_t       userdef_082;
/* 083 */   ptr_t       userdef_083;
/* 084 */   ptr_t       userdef_084;
/* 085 */   ptr_t       userdef_085;
/* 086 */   ptr_t       userdef_086;
/* 087 */   ptr_t       userdef_087;
/* 088 */   ptr_t       userdef_088;
/* 089 */   ptr_t       userdef_089;
/* 090 */   ptr_t       userdef_090;
/* 091 */   ptr_t       userdef_091;
/* 092 */   ptr_t       userdef_092;
/* 093 */   ptr_t       userdef_093;
/* 094 */   ptr_t       userdef_094;
/* 095 */   ptr_t       userdef_095;
/* 096 */   ptr_t       userdef_096;
/* 097 */   ptr_t       userdef_097;
/* 098 */   ptr_t       userdef_098;
/* 099 */   ptr_t       userdef_099;
/* 100 */   ptr_t       userdef_100;
/* 101 */   ptr_t       userdef_101;
/* 102 */   ptr_t       userdef_102;
/* 103 */   ptr_t       userdef_103;
/* 104 */   ptr_t       userdef_104;
/* 105 */   ptr_t       userdef_105;
/* 106 */   ptr_t       userdef_106;
/* 107 */   ptr_t       userdef_107;
/* 108 */   ptr_t       userdef_108;
/* 109 */   ptr_t       userdef_109;
/* 110 */   ptr_t       userdef_110;
/* 111 */   ptr_t       userdef_111;
/* 112 */   ptr_t       userdef_112;
/* 113 */   ptr_t       userdef_113;
/* 114 */   ptr_t       userdef_114;
/* 115 */   ptr_t       userdef_115;
/* 116 */   ptr_t       userdef_116;
/* 117 */   ptr_t       userdef_117;
/* 118 */   ptr_t       userdef_118;
/* 119 */   ptr_t       userdef_119;
/* 120 */   ptr_t       userdef_120;
/* 121 */   ptr_t       userdef_121;
/* 122 */   ptr_t       userdef_122;
/* 123 */   ptr_t       userdef_123;
/* 124 */   ptr_t       userdef_124;
/* 125 */   ptr_t       userdef_125;
/* 126 */   ptr_t       userdef_126;
/* 127 */   ptr_t       userdef_127;
/* 128 */   ptr_t       userdef_128;
/* 129 */   ptr_t       userdef_129;
/* 130 */   ptr_t       userdef_130;
/* 131 */   ptr_t       userdef_131;
/* 132 */   ptr_t       userdef_132;
/* 133 */   ptr_t       userdef_133;
/* 134 */   ptr_t       userdef_134;
/* 135 */   ptr_t       userdef_135;
/* 136 */   ptr_t       userdef_136;
/* 137 */   ptr_t       userdef_137;
/* 138 */   ptr_t       userdef_138;
/* 139 */   ptr_t       userdef_139;
/* 140 */   ptr_t       userdef_140;
/* 141 */   ptr_t       userdef_141;
/* 142 */   ptr_t       userdef_142;
/* 143 */   ptr_t       userdef_143;
/* 144 */   ptr_t       userdef_144;
/* 145 */   ptr_t       userdef_145;
/* 146 */   ptr_t       userdef_146;
/* 147 */   ptr_t       userdef_147;
/* 148 */   ptr_t       userdef_148;
/* 149 */   ptr_t       userdef_149;
/* 150 */   ptr_t       userdef_150;
/* 151 */   ptr_t       userdef_151;
/* 152 */   ptr_t       userdef_152;
/* 153 */   ptr_t       userdef_153;
/* 154 */   ptr_t       userdef_154;
/* 155 */   ptr_t       userdef_155;
/* 156 */   ptr_t       userdef_156;
/* 157 */   ptr_t       userdef_157;
/* 158 */   ptr_t       userdef_158;
/* 159 */   ptr_t       userdef_159;
/* 160 */   ptr_t       userdef_160;
/* 161 */   ptr_t       userdef_161;
/* 162 */   ptr_t       userdef_162;
/* 163 */   ptr_t       userdef_163;
/* 164 */   ptr_t       userdef_164;
/* 165 */   ptr_t       userdef_165;
/* 166 */   ptr_t       userdef_166;
/* 167 */   ptr_t       userdef_167;
/* 168 */   ptr_t       userdef_168;
/* 169 */   ptr_t       userdef_169;
/* 170 */   ptr_t       userdef_170;
/* 171 */   ptr_t       userdef_171;
/* 172 */   ptr_t       userdef_172;
/* 173 */   ptr_t       userdef_173;
/* 174 */   ptr_t       userdef_174;
/* 175 */   ptr_t       userdef_175;
/* 176 */   ptr_t       userdef_176;
/* 177 */   ptr_t       userdef_177;
/* 178 */   ptr_t       userdef_178;
/* 179 */   ptr_t       userdef_179;
/* 180 */   ptr_t       userdef_180;
/* 181 */   ptr_t       userdef_181;
/* 182 */   ptr_t       userdef_182;
/* 183 */   ptr_t       userdef_183;
/* 184 */   ptr_t       userdef_184;
/* 185 */   ptr_t       userdef_185;
/* 186 */   ptr_t       userdef_186;
/* 187 */   ptr_t       userdef_187;
/* 188 */   ptr_t       userdef_188;
/* 189 */   ptr_t       userdef_189;
/* 190 */   ptr_t       userdef_190;
/* 191 */   ptr_t       userdef_191;
/* 192 */   ptr_t       userdef_192;
/* 193 */   ptr_t       userdef_193;
/* 194 */   ptr_t       userdef_194;
/* 195 */   ptr_t       userdef_195;
/* 196 */   ptr_t       userdef_196;
/* 197 */   ptr_t       userdef_197;
/* 198 */   ptr_t       userdef_198;
/* 199 */   ptr_t       userdef_199;
/* 200 */   ptr_t       userdef_200;
/* 201 */   ptr_t       userdef_201;
/* 202 */   ptr_t       userdef_202;
/* 203 */   ptr_t       userdef_203;
/* 204 */   ptr_t       userdef_204;
/* 205 */   ptr_t       userdef_205;
/* 206 */   ptr_t       userdef_206;
/* 207 */   ptr_t       userdef_207;
/* 208 */   ptr_t       userdef_208;
/* 209 */   ptr_t       userdef_209;
/* 210 */   ptr_t       userdef_210;
/* 211 */   ptr_t       userdef_211;
/* 212 */   ptr_t       userdef_212;
/* 213 */   ptr_t       userdef_213;
/* 214 */   ptr_t       userdef_214;
/* 215 */   ptr_t       userdef_215;
/* 216 */   ptr_t       userdef_216;
/* 217 */   ptr_t       userdef_217;
/* 218 */   ptr_t       userdef_218;
/* 219 */   ptr_t       userdef_219;
/* 220 */   ptr_t       userdef_220;
/* 221 */   ptr_t       userdef_221;
/* 222 */   ptr_t       userdef_222;
/* 223 */   ptr_t       userdef_223;
/* 224 */   ptr_t       userdef_224;
/* 225 */   ptr_t       userdef_225;
/* 226 */   ptr_t       userdef_226;
/* 227 */   ptr_t       userdef_227;
/* 228 */   ptr_t       userdef_228;
/* 229 */   ptr_t       userdef_229;
/* 230 */   ptr_t       userdef_230;
/* 231 */   ptr_t       userdef_231;
/* 232 */   ptr_t       userdef_232;
/* 233 */   ptr_t       userdef_233;
/* 234 */   ptr_t       userdef_234;
/* 235 */   ptr_t       userdef_235;
/* 236 */   ptr_t       userdef_236;
/* 237 */   ptr_t       userdef_237;
/* 238 */   ptr_t       userdef_238;
/* 239 */   ptr_t       userdef_239;
/* 240 */   ptr_t       userdef_240;
/* 241 */   ptr_t       userdef_241;
/* 242 */   ptr_t       userdef_242;
/* 243 */   ptr_t       userdef_243;
/* 244 */   ptr_t       userdef_244;
/* 245 */   ptr_t       userdef_245;
/* 246 */   ptr_t       userdef_246;
/* 247 */   ptr_t       userdef_247;
/* 248 */   ptr_t       userdef_248;
/* 249 */   ptr_t       userdef_249;
/* 250 */   ptr_t       userdef_250;
/* 251 */   ptr_t       userdef_251;
/* 252 */   ptr_t       userdef_252;
/* 253 */   ptr_t       userdef_253;
/* 254 */   ptr_t       userdef_254;
/* 255 */   ptr_t       userdef_255;
};

#endif  // __EXCEPTIONS_H__
